emacs/.emacs.d/synthmacs.org
** which-key
:PROPERTIES:
:CUSTOM_ID: h:40130D60-680F-44CF-B7CD-FF38E97CB2EF
:END:
#+begin_src emacs-lisp
(setq which-key-idle-delay 0.4)
(use-package which-key
  :demand
  :general
  (synthmacs/leader-keys
    "?" 'which-key-show-top-level)
  :init
  (setq which-key-side-window-location 'bottom)
  (setq which-key-sort-order #'which-key-key-order-alpha)
  ;;(setq which-key-sort-order #'which-key-prefix-then-key-order)
  (setq which-key-sort-uppercase-first nil)
  (setq which-key-add-column-padding 1)
  (setq which-key-max-display-columns nil)
  (setq which-key-min-display-lines 6)
  (setq which-key-side-window-slot -10)
  (setq which-key-side-window-max-height 0.25)
  (setq which-key-max-description-length 25)
  (setq which-key-allow-imprecise-window-fit t)
  (setq which-key-separator " → ")
  (setq which-key-prefix-prefix "+")
  :config
  (which-key-mode 1)
  ;; Rename the entry for M-1 in the SPC h k Top-level bindings,
  ;; and for 1 in the SPC- Spacemacs root, to 1..9
  (push '(("\\(.*\\)1" . "winum-select-window-1") .
	  ("\\11..9" . "select window 1..9"))
	which-key-replacement-alist)

  ;; Hide the entries for M-[2-9] in the SPC h k Top-level bindings,
  ;; and for [2-9] in the SPC- Spacemacs root
  (push '((nil . "winum-select-window-[2-9]") . t)
	which-key-replacement-alist))
#+end_src

** rainbow-delimiters
:PROPERTIES:
:CUSTOM_ID: h:67838E6E-FA0F-4C8A-A56B-1939A6940C6E
:END:

#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Popup management
:PROPERTIES:
:CUSTOM_ID: h:EA42A190-FB24-4B06-9E3E-C6EBDD23BD5B
:END:
Taken from [[https://emacs.stackexchange.com/questions/46210/reuse-help-window][this stackexchange answer]].

#+begin_src emacs-lisp
(use-package emacs
  :init
  (setq display-buffer-alist
        `((,(rx bos (or "*Apropos*" "*Help*" "*helpful" "*info*" "*Summary*") (0+ not-newline))
           (display-buffer-reuse-mode-window display-buffer-below-selected)
           (window-height . 0.33)
           (mode apropos-mode help-mode helpful-mode Info-mode Man-mode))))
  )
#+end_src

** centered-cursor-mode
:PROPERTIES:
:CUSTOM_ID: h:097E7F3B-CCB0-4B8F-887F-01A6101AB77E
:END:
Sometimes, I want my cursor to be stuck in the center!
#+begin_src emacs-lisp
(use-package centered-cursor-mode
  :general
  (synthmacs/leader-keys
    "t=" '((lambda () (interactive) (centered-cursor-mode 'toggle)) :wk "center cursor")
    )
  )
#+end_src

** highlight-indent-guides
:PROPERTIES:
:CUSTOM_ID: h:35269B3F-EFD1-4DB9-83F3-85E82AD1435F
:END:
It's useful to know indents, and I like seeing it, so let's do it!

#+begin_src emacs-lisp
(use-package highlight-indent-guides
  :hook (prog-mode . highlight-indent-guides-mode)
  :init
  ;; (setq highlight-indent-guides-method 'column)
  ;; (setq highlight-indent-guides-method 'bitmap)
  (setq highlight-indent-guides-method 'character)
  (setq highlight-indent-guides-character ?‖)
  (setq highlight-indent-guides-responsive 'top)
  ;; (setq highlight-indent-guides-responsive 'stack)
  ;; (setq highlight-indent-guides-auto-enabled nil)
  ;; (set-face-background 'highlight-indent-guides-odd-face "darkgray")
  ;; (set-face-background 'highlight-indent-guides-even-face "dimgray")
  ;; (set-face-foreground 'highlight-indent-guides-character-face "dimgray")
  )
#+end_src


** Line numbers
:PROPERTIES:
:CUSTOM_ID: h:AEE6BF5E-C716-41A4-80E6-45512D31F9B5
:END:
#+begin_src emacs-lisp
(use-package emacs
  :init
  ;; ------------------ Line Numbering ---------------------
  ;; set type of line numbering (global variable)
  (setq display-line-numbers-type 'relative)
  ;; activate line numbering in all buffers/modes
  (global-display-line-numbers-mode 1)

  (dolist (mode '(org-mode-hook
		  term-mode-hook
		  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  ;; Activate line numbering in programming modes
  ;; (add-hook 'prog-mode-hook 'display-line-numbers-mode)
  )
#+end_src

** Fill column & modeline column info
:PROPERTIES:
:CUSTOM_ID: h:9F8FCA21-383E-42FA-BA7D-59DD3ECEB950
:END:
#+begin_src emacs-lisp
(use-package emacs
  ;; :hook (prog-mode . display-fill-column-indicator-mode)
  :init
  (setq-default fill-column 85)
  (global-display-fill-column-indicator-mode)

  ;; Columns number in the modeline
  (setq column-number-mode t)
  )
#+end_src

* Completion framework
:PROPERTIES:
:CUSTOM_ID: h:FB3661CB-A573-40B6-B331-449D77DBD199
:header-args: :emacs-lisp :tangle ./synthmacs/synthmacs-completion-framework.el
:END:

** Vertico
:PROPERTIES:
:CUSTOM_ID: h:5D5A0CE5-8CC2-4134-8CCB-52074A0B8654
:END:

*** vertico
:PROPERTIES:
:CUSTOM_ID: h:305A854E-184C-49CC-A5D5-7BD424A36F82
:END:
#+begin_src emacs-lisp
(use-package vertico
  :straight (vertico :files (:defaults "extensions/*")
                     :includes (vertico-indexed
                                vertico-flat
                                vertico-grid
                                vertico-mouse
                                ;; vertico-quick
                                vertico-buffer
                                vertico-repeat
                                vertico-reverse
                                vertico-directory
                                vertico-multiform
                                vertico-unobtrusive
                                ))
  :demand
  :general
  ;; (:keymaps 'minibuffer-local-map
  (:keymaps 'vertico-map
	    "C-~" #'synthmacs/minibuffer-backwards-kill
	    "C-h" #'vertico-directory-delete-word
	    )
  
  ;; :hook
  ;; ((minibuffer-setup . vertico-repeat-save) ; Make sure vertico state is saved for `vertico-repeat'
  ;;  (rfn-eshadow-update-overlay . vertico-directory-tidy) ; Clean up file path when typing
  ;;  ) 
  :init
  ;; Different scroll margin
  ;; (setq vertico-scroll-margin 0)

  ;; Show more candidates
  ;; (setq vertico-count 20)

  ;; Grow and shrink the Vertico minibuffer
  ;; (setq vertico-resize t)

  ;; Optionally enable cycling for `vertico-next' and `vertico-previous'.
  (setq vertico-cycle t)

  :config
  (vertico-mode)

  ;; Prefix the current candidate with “» ”. From
  ;; https://github.com/minad/vertico/wiki#prefix-current-candidate-with-arrow
  (advice-add #'vertico--format-candidate :around
              (lambda (orig cand prefix suffix index _start)
                (setq cand (funcall orig cand prefix suffix index _start))
                (concat
                 (if (= vertico--index index)
                     (propertize "» " 'face 'vertico-current)
                   "  ")
                 cand)))
  )
#+end_src

*** savehist
:PROPERTIES:
:CUSTOM_ID: h:C124D838-E80B-45F5-B2E7-EBAF277BFDF0
:END:
Persist history over Emacs restarts. Vertico sorts by history position.

#+begin_src emacs-lisp
(use-package savehist
  :init
  (savehist-mode))
#+end_src

*** Emacs & Vertico
:PROPERTIES:
:CUSTOM_ID: h:3997A77C-E1E4-4B26-88DA-ECAE5794367B
:END:
A few more useful Emacs configs for Vectico

#+begin_src emacs-lisp
(use-package emacs
  :init
  ;; Add prompt indicator to `completing-read-multiple'.
  ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
  (defun crm-indicator (args)
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string
                   "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                   crm-separator)
                  (car args))
          (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Emacs 28: Hide commands in M-x which do not work in the current mode.
  ;; Vertico commands are hidden in normal buffers.
  ;; (setq read-extended-command-predicate
  ;;       #'command-completion-default-include-p)

  ;; Enable recursive minibuffers
  (setq enable-recursive-minibuffers t)

  ;; Focus the help window when bringing it up, so that I can quit it easily
  (setq help-window-select t)
  )
#+end_src

** Orderless
:PROPERTIES:
:CUSTOM_ID: h:CF8C8DA3-23A3-4CF0-80A9-3DB977BB0182
:END:
#+begin_src emacs-lisp
(use-package orderless
  :init
  ;; Configure a custom style dispatcher (see the Consult wiki)
  ;; (setq orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch)
  ;;       orderless-component-separator #'orderless-escapable-split-on-space)
  (setq completion-styles '(orderless basic)
        completion-category-defaults nil
        completion-category-overrides '((file (styles partial-completion)))))
#+end_src

