emacs/.emacs.d/synthmacs.org
** wgrep
:PROPERTIES:
:CUSTOM_ID: h:B61A56F5-8DE2-4317-99A2-400E08DCFB87
:END:
After running ~embark-export~, we can edit the results with ~wgrep~ and commit the edits. This is extremely powerful for refactorings such as changing the name of a class or a function across files in the project. For more, check out [[https://lambdaland.org/posts/2023-05-31_warp_factor_refactor/][Warp Refactoring in Emacs]]

#+begin_src emacs-lisp
(use-package wgrep
  ;; :general
  ;; (grep-mode-may "W" 'wgrep-change-to-wgrep-mode)
  :init
  (setq wgrep-auto-save-buffer t)
  (setq wgrep-change-readonly-file t)
  )
#+end_src

* Useful Tools
:PROPERTIES:
:CUSTOM_ID: h:B57C03F6-2111-489A-9303-B1A06C95EFF5
:header-args: :emacs-lisp :tangle ./synthmacs/synthmacs-tools.el
:END:

** Helpful
:PROPERTIES:
:CUSTOM_ID: h:949B41C1-C4A4-484B-9A6A-76A07DBBFCB1
:END:
#+begin_src emacs-lisp
(use-package helpful
  :general
  (synthmacs/leader-keys
    "h." '(helpful-at-point :wk "helpful-at-point")
    "hc" '(helpful-command :wk "describe-command")
    "hf" '(helpful-callable :wk "describe-function")
    "hk" '(helpful-key :wk "describe-key")
    "hv" '(helpful-variable :wk "describe-variable")))
#+end_src

** Rg
:PROPERTIES:
:CUSTOM_ID: h:BFB3F21C-B7E7-4057-AF46-5B9C1A6DEF0C
:END:
#+begin_src emacs-lisp
(use-package rg
  :ensure-system-package rg)
#+end_src

** Projectile
:PROPERTIES:
:CUSTOM_ID: h:1653A50A-82D1-416F-830C-00B886B5A241
:END:
#+begin_src emacs-lisp
(use-package projectile
  :diminish
  :general
  (synthmacs/leader-keys
    "pf" '(projectile-find-file :wk "projectile-find-file")
    "pk" '(projectile-kill-buffers :wk "projectile-kill-buffers")
    "pp" '(projectile-switch-project :wk "projectile-switch-project")
    "pr" '(projectile-recentf :wk "projectile-recentf")
    "pm" '(projectile-command-map :wk "projectile menu"))
  :custom ((projectile-completion-system 'auto))
  :init
  (projectile-mode +1)
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/Developer")
    (setq projectile-project-search-path '("~/Developer")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package consult-projectile)
#+end_src

** Git/VCS Integration
:PROPERTIES:
:CUSTOM_ID: h:38F6723F-CA92-401B-BE94-8130078BAD7E
:END:
#+begin_src emacs-lisp
(use-package magit
  ;; :custom
  ;; (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
  :general
  (synthmacs/leader-keys
    "gs" '(magit-status :wk "magit-status")))

;; - https://magit.vc/manual/forge/Token-Creation.html#Token-Creation
;; - https://magit.vc/manual/ghub/Getting-Started.html#Getting-Started
;; (use-package forge)

(use-package git-gutter
  :hook (prog-mode . git-gutter-mode)
  :config
  (setq git-gutter:update-interval 0.02))

(use-package git-gutter-fringe
  :config
(define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
(define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
(define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom))

(synthmacs/leader-keys
  "gb" '(magit-blame-addition :wk "magit-blame")
  "gc" '(magit-clone :wk "magit-clone")
  "gd" '(magit-dispatch :wk "magit-dispatch")
  "gf" '(magit-file-dispatch :wk "magit-file-dispatch")
  "gh" '(magit-info :wk "magit-help")
  "gi" '(magit-init :wk "magit-init"))
#+end_src

** WS-Butler
:PROPERTIES:
:CUSTOM_ID: h:C8E39F4E-D75F-4031-8205-F1A7F865B91A
:END:

#+begin_src emacs-lisp
(use-package ws-butler
  :init
  ;; (ws-butler-global-mode 1)
  (add-hook 'prog-mode-hook #'ws-butler-mode))
#+end_src

* Programming Environment
:PROPERTIES:
:CUSTOM_ID: h:2E967F87-8304-4262-B5BF-3286ACA7211B
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-programming.el
:END:

** LSP
:PROPERTIES:
:CUSTOM_ID: h:222F2EE3-FD70-4274-AABC-759B5F7556C5
:END:
#+begin_src emacs-lisp
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "C-c l")
  :hook
  (lsp-mode . lsp-enable-which-key-integration))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :after lsp)

;; optionally if you want to use debugger
;; (use-package dap-mode)
;; (use-package dap-LANGUAGE) to load the dap adapter for your language
#+end_src

** Corfu
:PROPERTIES:
:CUSTOM_ID: h:4B6D88C2-0393-4462-9C06-37BD9160B415
:END:
#+begin_src emacs-lisp
(use-package corfu
  :straight (corfu :files (:defaults "extensions/*")
		   :includes (corfu-popupinfo))
  :hook (corfu-mode . corfu-popupinfo-mode)
  ;; Optional customizations
  :custom
  (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
  (corfu-auto t)                 ;; Enable auto completion
  ;; (corfu-auto-delay 0.0)
  ;; (corfu-auto-prefix 0)
  (corfu-separator ?\s)          ;; Orderless field separator
  (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
  ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
  ;; (corfu-preview-current nil)    ;; Disable current candidate preview
  ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
  ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
  ;; (corfu-scroll-margin 5)        ;; Use scroll margin

  ;; Enable Corfu only for certain modes.
  ;; :hook ((prog-mode . corfu-mode)
  ;;        (shell-mode . corfu-mode)
  ;;        (eshell-mode . corfu-mode))

  (corfu-popupinfo-delay 1)
  (corfu-popupinfo-max-height 15)
  ;; Recommended: Enable Corfu globally.
  ;; This is recommended since Dabbrev can be used globally (M-/).
  ;; See also `corfu-exclude-modes'.
  :general
  (synthmacs/leader-keys
  "ta" '(global-corfu-mode :wk "auto-completion"))
  :init
  (global-corfu-mode)
  :config
  (keymap-set corfu-map "C-d" 'corfu-popupinfo-scroll-down)
  (keymap-set corfu-map "C-u" 'corfu-popupinfo-scroll-up)
  (keymap-set corfu-map "C-i" 'corfu-popupinfo-toggle))

;; A few more useful configurations...
(use-package emacs
  :init
  ;; TAB cycle if there are only few candidates
  (setq completion-cycle-threshold 3)

  ;; Emacs 28: Hide commands in M-x which do not apply to the current mode.
  ;; Corfu commands are hidden, since they are not supposed to be used via M-x.
  ;; (setq read-extended-command-predicate
  ;;       #'command-completion-default-include-p)

  ;; Enable indentation+completion using the TAB key.
  ;; `completion-at-point' is often bound to M-TAB.
  (setq tab-always-indent 'complete))

(use-package kind-icon
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default) ; to compute blended backgrounds correctly
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+end_src

** Dirvish
:PROPERTIES:
:CUSTOM_ID: h:895ADECA-8F1A-4FBB-A930-871EE0B6D4D8
:END:

#+begin_src emacs-lisp :tangle no
(use-package dirvish
  :init
  (dirvish-override-dired-mode)
  :config
  (setq delete-by-moving-to-trash t
	dirvish-attributes
	'(all-the-icons file-size collapse subtree-state vc-state)
	dirvish-side-width 45
	dirvish-side-follow-mode t
	))

(synthmacs/leader-keys
  "fm" '(dirvish :wk "file manager")
  "ft" '(dirvish-side :wk "file tree"))

;; Addtional syntax highlighting for dired
(use-package diredfl
  :hook
  ((dired-mode . diredfl-mode)
   ;; highlight parent and directory preview as well
   (dirvish-directory-view-mode . diredfl-mode))
  :config
  (set-face-attribute 'diredfl-dir-name nil :bold t))
#+end_src

** Flycheck
:PROPERTIES:
:CUSTOM_ID: h:337359CD-0A1C-48AE-A141-36BFC0FE4641
:END:
#+begin_src emacs-lisp
(use-package flycheck
  :init (global-flycheck-mode))
#+end_src

** iMenu
:PROPERTIES:
:CUSTOM_ID: h:A05AB852-E81B-4B50-B873-6A3C2A917C08
:END:
#+begin_src emacs-lisp
(use-package imenu-list)

(synthmacs/leader-keys
  "ti" '(imenu-list-smart-toggle :wx "imenu-list-smart-toggle"))

#+end_src

** Snippets
:PROPERTIES:
:CUSTOM_ID: h:36F5A754-136E-4AA5-967D-358D69599D01
:END:
#+begin_src emacs-lisp
(use-package yasnippet)

;; (yas-reload-all)
(add-hook 'prog-mode-hook #'yas-minor-mode)

(use-package yasnippet-snippets)
(use-package common-lisp-snippets)
#+end_src

** Treesitter
:PROPERTIES:
:CUSTOM_ID: h:1A1DAD25-321C-4F90-A226-1C14A4F7A79F
:END:
#+begin_src emacs-lisp
(require 'treesit)

(use-package tree-sitter-langs)

;; Load the language bundle
(require 'tree-sitter-langs)

;; (setq treesit-language-source-alist
;;    '((bash "https://github.com/tree-sitter/tree-sitter-bash")
;;      (c "https://github.com/tree-sitter/tree-sitter-c")
;;      (cmake "https://github.com/uyha/tree-sitter-cmake")
;;      (clojure "https://github.com/sogaiu/tree-sitter-clojure")
;;      (commonlisp "https://github.com/theHamsta/tree-sitter-commonlisp")
;;      (css "https://github.com/tree-sitter/tree-sitter-css")
;;      (elixir "https://github.com/elixir-lang/tree-sitter-elixir")
;;      (elisp "https://github.com/Wilfred/tree-sitter-elisp")
;;      (go "https://github.com/tree-sitter/tree-sitter-go")
;;      (html "https://github.com/tree-sitter/tree-sitter-html")
;;      (haskell "https://github.com/tree-sitter/tree-sitter-haskell")
;;      (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
;;      (json "https://github.com/tree-sitter/tree-sitter-json")
;;      (lua "https://github.com/Azganoth/tree-sitter-lua")
;;      (make "https://github.com/alemuller/tree-sitter-make")
;;      (markdown "https://github.com/ikatyang/tree-sitter-markdown")
;;      (objc "https://github.com/jiyee/tree-sitter-objc")
;;      ;; (ocaml "https://github.com/tree-sitter/tree-sitter-ocaml")
;;      (python "https://github.com/tree-sitter/tree-sitter-python")
;;      (racket "https://github.com/6cdh/tree-sitter-racket")
;;      (ruby "https://github.com/tree-sitter/tree-sitter-ruby")
;;      (rust "https://github.com/tree-sitter/tree-sitter-rust")
;;      (scheme "https://github.com/6cdh/tree-sitter-scheme")
;;      (sqlite "https://github.com/dhcmrlchtdj/tree-sitter-sqlite")
;;      (sql "https://github.com/m-novikov/tree-sitter-sql")
;;      ;; (swift "https://gitlab.com/woolsweater/tree-sitter-swifter")
;;      (toml "https://github.com/tree-sitter/tree-sitter-toml")
;;      (yaml "https://github.com/ikatyang/tree-sitter-yaml")
;;      (zig "https://github.com/maxxnino/tree-sitter-zig")))

;; (defun synthmacs/treesit-install-all-languages ()
;;     "Install all languages specified by `treesit-language-source-alist'."
;;     (interactive)
;;     (let ((languages (mapcar 'car treesit-language-source-alist)))
;;       (dolist (lang languages)
;; 	      (treesit-install-language-grammar lang)
;; 	      (message "`%s' parser was installed." lang)
;; 	      (sit-for 0.75))))

;; (add-hook 'c-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'c t)
;; 		    (c-ts-mode)
;; 		  (c-mode))))

;; (add-hook 'common-lisp-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'commonlisp t)
;; 		    (common-lisp-ts-mode)
;; 		  (common-lisp-mode))))

;; (add-hook 'clojure-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'clojure t)
;; 		    (clojure-ts-mode)
;; 		  (clojure-mode))))

;; (add-hook 'css-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'css t)
;; 		    (css-ts-mode)
;; 		  (css-mode))))

;; (add-hook 'html-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'html t)
;; 		    (html-ts-mode)
;; 		  (html-mode))))

;; (add-hook 'haskell-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'haskell t)
;; 		    (haskell-ts-mode)
;; 		  (haskell-mode))))

;; (add-hook 'javascript-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'javascript t)
;; 		    (js-ts-mode)
;; 		  (javascript-mode))))

;; (add-hook 'js-json-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'json t)
;; 		    (json-ts-mode)
;; 		  (js-json-mode))))

;; (add-hook 'python-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'python t)
;; 		    (python-ts-mode)
;; 		  (python-mode))))

;; (add-hook 'sh-mode-hook
;; 	  (lambda () (if (treesit-ready-p 'bash t)
;; 		    (bash-ts-mode)
;; 		  (sh-mode))))
#+end_src

* Programming Languages
:PROPERTIES:
:CUSTOM_ID: h:732BA080-834D-49E0-967E-0D37CE1C6BA0
:END:

** Clojure
:PROPERTIES:
:CUSTOM_ID: h:FF09BB1E-5437-4AFF-A4F5-367B92AF76CC
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-clojure.el
:END:
** Haskell
:PROPERTIES:
:CUSTOM_ID: h:28BA5E9F-6893-4E40-9F42-246F8731948C
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-haskell.el
:END:
** HTML
:PROPERTIES:
:CUSTOM_ID: h:5561B91C-C61D-47D5-8320-9A559032C762
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-html.el
:END:
** LISP
:PROPERTIES:
:CUSTOM_ID: h:2171FA3F-D9BC-4058-9442-6827BABFC2CE
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-lisp.el
:END:
#+begin_src emacs-lisp
(use-package sly)

(use-package sly-macrostep)

(use-package sly-repl-ansi-color
  :init
  (add-to-list 'sly-contribs 'sly-repl-ansi-color))
#+end_src

** Markdown
:PROPERTIES:
:CUSTOM_ID: h:80E9702A-E2B6-44B5-A139-AD16C9B5D92F
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-markdown.el
:END:
** Rust
:PROPERTIES:
:CUSTOM_ID: h:6355CFE4-6BA5-4134-BA38-74634F9FF919
:header-args:    :emacs-lisp :tangle ./synthmacs/synthmacs-lang-rust.el
:END:
