emacs/.emacs.d/synthmacs/synthmacs-completion-framework.el
;;; synthmacs-completion-framework.el ends here
