emacs/.emacs.d/synthmacs/synthmacs-tools.el
;;; synthmacs-tools.el ends here
